### Project: kj-pola-backend-stg

#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
module.gh_oidc.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/kj-pola-backend-stg/locations/global/workloadIdentityPools/github-actions-pool]
module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/serviceusage.googleapis.com]
module.project_services.google_project_service.project_services["monitoring.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/monitoring.googleapis.com]
module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/compute.googleapis.com]
module.project_services.google_project_service.project_services["logging.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/logging.googleapis.com]
module.service_account.google_service_account.service_accounts["terraform-runner"]: Refreshing state... [id=projects/kj-pola-backend-stg/serviceAccounts/terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.project_services.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/run.googleapis.com]
module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/iam.googleapis.com]
module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/cloudresourcemanager.googleapis.com]
module.project_services.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/sqladmin.googleapis.com]
module.project_services.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/servicenetworking.googleapis.com]
module.project_services.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=kj-pola-backend-stg/storage.googleapis.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/iam.serviceAccountUser"]: Refreshing state... [id=kj-pola-backend-stg/roles/iam.serviceAccountUser/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=kj-pola-backend-stg/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/cloudsql.admin"]: Refreshing state... [id=kj-pola-backend-stg/roles/cloudsql.admin/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/compute.networkAdmin"]: Refreshing state... [id=kj-pola-backend-stg/roles/compute.networkAdmin/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/storage.objectAdmin"]: Refreshing state... [id=kj-pola-backend-stg/roles/storage.objectAdmin/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/artifactregistry.reader"]: Refreshing state... [id=kj-pola-backend-stg/roles/artifactregistry.reader/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/viewer"]: Refreshing state... [id=kj-pola-backend-stg/roles/viewer/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/run.admin"]: Refreshing state... [id=kj-pola-backend-stg/roles/run.admin/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.service_account.google_project_iam_member.project-roles["terraform-runner-kj-pola-backend-stg=>roles/servicenetworking.networksAdmin"]: Refreshing state... [id=kj-pola-backend-stg/roles/servicenetworking.networksAdmin/serviceAccount:terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com]
module.gh_oidc.google_iam_workload_identity_pool_provider.main: Refreshing state... [id=projects/kj-pola-backend-stg/locations/global/workloadIdentityPools/github-actions-pool/providers/github-actions-provider]
module.gh_oidc.google_service_account_iam_member.wif-sa["terraform-runner"]: Refreshing state... [id=projects/kj-pola-backend-stg/serviceAccounts/terraform-runner@kj-pola-backend-stg.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/901165314592/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/KlubJagiellonski/pola-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.google_compute_global_address.psa_ranges["servicenetworking-googleapis-com-pola-backend-stg-psa-range"] will be created
  + resource "google_compute_global_address" "psa_ranges" {
      + address            = "10.1.0.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "app"                        = "pola"
          + "component"                  = "backend"
          + "env"                        = "stg"
          + "goog-terraform-provisioned" = "true"
          + "iac"                        = "terraform"
          + "org"                        = "klubjagiellonski"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "servicenetworking-googleapis-com-pola-backend-stg-psa-range"
      + network            = (known after apply)
      + prefix_length      = 24
      + project            = "kj-pola-backend-stg"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "app"                        = "pola"
          + "component"                  = "backend"
          + "env"                        = "stg"
          + "goog-terraform-provisioned" = "true"
          + "iac"                        = "terraform"
          + "org"                        = "klubjagiellonski"
        }
    }

  # module.vpc.google_compute_network.network[0] will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_bgp_always_compare_med             = false
      + delete_default_routes_on_create           = false
      + description                               = "Terraform-managed."
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "pola-backend-stg-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "kj-pola-backend-stg"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.vpc.google_compute_network_peering_routes_config.psa_routes["servicenetworking.googleapis.com"] will be created
  + resource "google_compute_network_peering_routes_config" "psa_routes" {
      + export_custom_routes                = false
      + export_subnet_routes_with_public_ip = (known after apply)
      + id                                  = (known after apply)
      + import_custom_routes                = false
      + import_subnet_routes_with_public_ip = (known after apply)
      + network                             = "pola-backend-stg-vpc"
      + peering                             = (known after apply)
      + project                             = "kj-pola-backend-stg"
    }

  # module.vpc.google_compute_route.gateway["directpath-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "34.126.0.0/18"
      + id                         = (known after apply)
      + name                       = "pola-backend-stg-vpc-directpath-googleapis"
      + network                    = "pola-backend-stg-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "kj-pola-backend-stg"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.vpc.google_compute_route.gateway["private-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.8/30"
      + id                         = (known after apply)
      + name                       = "pola-backend-stg-vpc-private-googleapis"
      + network                    = "pola-backend-stg-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "kj-pola-backend-stg"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.vpc.google_compute_route.gateway["restricted-googleapis"] will be created
  + resource "google_compute_route" "gateway" {
      + as_paths                   = (known after apply)
      + creation_timestamp         = (known after apply)
      + description                = "Terraform-managed."
      + dest_range                 = "199.36.153.4/30"
      + id                         = (known after apply)
      + name                       = "pola-backend-stg-vpc-restricted-googleapis"
      + network                    = "pola-backend-stg-vpc"
      + next_hop_gateway           = "default-internet-gateway"
      + next_hop_hub               = (known after apply)
      + next_hop_instance_zone     = (known after apply)
      + next_hop_inter_region_cost = (known after apply)
      + next_hop_ip                = (known after apply)
      + next_hop_med               = (known after apply)
      + next_hop_network           = (known after apply)
      + next_hop_origin            = (known after apply)
      + next_hop_peering           = (known after apply)
      + priority                   = 1000
      + project                    = "kj-pola-backend-stg"
      + route_status               = (known after apply)
      + route_type                 = (known after apply)
      + self_link                  = (known after apply)
      + warnings                   = (known after apply)
    }

  # module.vpc.google_compute_subnetwork.subnetwork["europe-central2/pola-backend-stg-subnet"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + allow_subnet_cidr_routes_overlap = (known after apply)
      + creation_timestamp               = (known after apply)
      + description                      = "Subnet dla Cloud Run Direct VPC Egress i Cloud SQL"
      + external_ipv6_prefix             = (known after apply)
      + fingerprint                      = (known after apply)
      + gateway_address                  = (known after apply)
      + id                               = (known after apply)
      + internal_ipv6_prefix             = (known after apply)
      + ip_cidr_range                    = "10.0.0.0/24"
      + ipv6_cidr_range                  = (known after apply)
      + ipv6_gce_endpoint                = (known after apply)
      + name                             = "pola-backend-stg-subnet"
      + network                          = "pola-backend-stg-vpc"
      + private_ip_google_access         = true
      + private_ipv6_google_access       = (known after apply)
      + project                          = "kj-pola-backend-stg"
      + purpose                          = (known after apply)
      + region                           = "europe-central2"
      + self_link                        = (known after apply)
      + send_secondary_ip_range_if_empty = true
      + stack_type                       = (known after apply)
      + state                            = (known after apply)
      + subnetwork_id                    = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.vpc.google_service_networking_connection.psa_connection["servicenetworking.googleapis.com"] will be created
  + resource "google_service_networking_connection" "psa_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "servicenetworking-googleapis-com-pola-backend-stg-psa-range",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_service_access_address = "10.1.0.0/24"
  + vpc_network_id                 = (known after apply)
  + vpc_network_name               = "pola-backend-stg-vpc"
  + vpc_network_self_link          = (known after apply)
  + vpc_subnet_id                  = (known after apply)
  + vpc_subnet_name                = "pola-backend-stg-subnet"
  + vpc_subnet_self_link           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @skibinstein, Action: `pull_request`, Working Directory: `stacks/projects/kj-pola-backend-stg`, Workflow: `Terraform`*